<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}


}

</style>

<b><center>
    <span style="font-size: 24pt; line-height: 1.2;">COMS W4111: Introduction to Databases</span><br>
    <span style="font-size: 24pt; line-height: 1.2;">Section 002, Spring 2023</span><br>
</center></b>
<br><br>
<i><center>
    <span style="font-size: 20pt; line-height: 1.2;">Final Exam: Practical Questions</span>
</center></i>

# Introduction and Guidance

# Submission Instructions

- Add submission instructions.

# Environment Setup and Test

## ipython-sql Magic

In [1]:
import json

In [2]:
import pandas

In [3]:
%load_ext sql

In [4]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [5]:
%sql select * from db_book.student limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('19991', 'Brandt', 'History', Decimal('80')),
 ('23121', 'Chavez', 'Finance', Decimal('110')),
 ('44553', 'Peltier', 'Physics', Decimal('56')),
 ('45678', 'Levy', 'Physics', Decimal('46')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('55739', 'Sanchez', 'Music', Decimal('38')),
 ('70557', 'Snow', 'Physics', Decimal('0')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58'))]

## PyMySQL

In [6]:
import pymysql

In [7]:
conn = pymysql.connect(
    host="localhost",
    user="root",
    password="dbuserdbuser",
    cursorclass=pymysql.cursors.DictCursor,
    autocommit=True)

In [8]:
cur = conn.cursor()
res = cur.execute("select * from db_book.student limit 10")
res = cur.fetchall()

In [9]:
res

[{'ID': '00128',
  'name': 'Zhang',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('102')},
 {'ID': '12345',
  'name': 'Shankar',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('32')},
 {'ID': '19991',
  'name': 'Brandt',
  'dept_name': 'History',
  'tot_cred': Decimal('80')},
 {'ID': '23121',
  'name': 'Chavez',
  'dept_name': 'Finance',
  'tot_cred': Decimal('110')},
 {'ID': '44553',
  'name': 'Peltier',
  'dept_name': 'Physics',
  'tot_cred': Decimal('56')},
 {'ID': '45678',
  'name': 'Levy',
  'dept_name': 'Physics',
  'tot_cred': Decimal('46')},
 {'ID': '54321',
  'name': 'Williams',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('54')},
 {'ID': '55739',
  'name': 'Sanchez',
  'dept_name': 'Music',
  'tot_cred': Decimal('38')},
 {'ID': '70557',
  'name': 'Snow',
  'dept_name': 'Physics',
  'tot_cred': Decimal('0')},
 {'ID': '76543',
  'name': 'Brown',
  'dept_name': 'Comp. Sci.',
  'tot_cred': Decimal('58')}]

## Pandas and SQLAlchemy

In [10]:
import numpy as np

In [11]:
import sqlalchemy

In [12]:
engine = sqlalchemy.create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

In [13]:
df = pandas.read_sql("select * from db_book.student limit 10", con=engine)

In [14]:
df

      ID      name   dept_name  tot_cred
0  00128     Zhang  Comp. Sci.     102.0
1  12345   Shankar  Comp. Sci.      32.0
2  19991    Brandt     History      80.0
3  23121    Chavez     Finance     110.0
4  44553   Peltier     Physics      56.0
5  45678      Levy     Physics      46.0
6  54321  Williams  Comp. Sci.      54.0
7  55739   Sanchez       Music      38.0
8  70557      Snow     Physics       0.0
9  76543     Brown  Comp. Sci.      58.0

## MongoDB

__Note:__ The following cell only works for me. I use this approach to avoid putting passwords in publicly accessible documents,

In [ ]:
import sys
import pymongo


sys.path.append(
    "/Users/donaldferguson/Dropbox/00Spring2023/Intro_to_Databases_S23/DONOTSHARE"
)

In [17]:
import mongo_secrets

mongo_url = mongo_secrets.mongo_atlas_url

In [18]:
# 
#
#
# You must set your Mongo Atlas URL.
#
mongo_client = pymongo.MongoClient(mongo_url)

In [19]:
list(mongo_client.list_databases())

[{'name': 'S23_GoT', 'sizeOnDisk': 417792, 'empty': False},
 {'name': 'classicmodels', 'sizeOnDisk': 262144, 'empty': False},
 {'name': 'simple_cloud', 'sizeOnDisk': 184320, 'empty': False},
 {'name': 'admin', 'sizeOnDisk': 344064, 'empty': False},
 {'name': 'local', 'sizeOnDisk': 34944516096, 'empty': False}]

## Neo4j

__Note:__ The following cells only work for me.

In [20]:
import neo4j_secrets

In [21]:
aura_url = neo4j_secrets.aura_url
aura_user = neo4j_secrets.aura_user
aura_pw = neo4j_secrets.aura_pw

In [22]:
import py2neo

- Uncomment and set the Aura information, then run the test.

In [23]:
from py2neo import Graph

# aura_url = 
# aura_user = 
# aura_pw = 

def t1():
    graph = Graph(aura_url, auth=(aura_user, aura_pw))
    q = "match (r:Person) where r.name='Tom Hanks' return r"
    res = graph.run(q)

    for r in res:
        print(r)

In [24]:
t1()

Node('Person', born=1956, name='Tom Hanks')

# Relational Algebra

- Just kidding.


- I think we all have had as much fun as we can stand using relational algebra and the RelaX calculator.


- You're welcome.

# Entity Relationship Modeling

## Definition to Model

- The model you will diagram has four entity types:
    1. Faculty has the properties:
        - UNI
        - last\_name
        - first\_name
        - job\_title
    2. Department has two properties:
        - department\_code
        - department\_name
    3. Student has the properties:
        - UNI
        - last\_name
        - first\_name
        - enrollment\_year
    4. Section:
        - section_id
        - semester
        - year
        - credits
        
        
- The model has the following relationships:
    1. Faculty_Department:
        - A faculty may be associated with one or more departments.
        - The association has a type: member, chair, emeritus.
    2. Student_Department:
        - A student has exactly one department that is the major_department.
        - The student may have 0 or one minor_department.
    3. Student_Section:
        - A student has a relationship to 0, 1 or many sections.
        - The student may be enrolled\_in_ the section or a ta\_for the section.
        - A section may have many enrolled students and many TAs.
    4. Faculty_Section:
        - A faculty member teaches exactly one section per semester.
        - A section has exactly one instructor per semester.
        
        
- Use Lucidchart to draw a Crow's Foot Notation ER diagram for the logical model. You may add notes to explain any reasonable assumptions you make.

<u>ER Diagram</u>

## Model to Schema

- Create a new schema ```s23_final_exam```.


- Implement and execute the DDL statements to implement your ER diagram.


- The university is extremely large. So, you should define indexes that you think appropriate.

<u>SQL DDL Statements</u>

# SQL

## Customer Summary

- The following is a view that is a summary of customers and orders from Classic Models.

In [25]:
%sql select * from s23_final.customer_order_summary limit 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('Online Diecast Creations Co.', 363, 10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 10), Decimal('10223.83')),
 ('Blauer See Auto, Co.', 128, 10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 11), Decimal('10549.01')),
 ('Vitachrome Inc.', 181, 10102, datetime.date(2003, 1, 10), datetime.date(2003, 1, 14), Decimal('5494.78')),
 ('Baane Mini Imports', 121, 10103, datetime.date(2003, 1, 29), datetime.date(2003, 2, 2), Decimal('50218.95')),
 ('Euro+ Shopping Channel', 141, 10104, datetime.date(2003, 1, 31), datetime.date(2003, 2, 1), Decimal('40206.20')),
 ('Danish Wholesale Imports', 145, 10105, datetime.date(2003, 2, 11), datetime.date(2003, 2, 12), Decimal('53959.21')),
 ('Rovelli Gifts', 278, 10106, datetime.date(2003, 2, 17), datetime.date(2003, 2, 21), Decimal('52151.81')),
 ('Land of Toys Inc.', 131, 10107, datetime.date(2003, 2, 24), datetime.date(2003, 2, 26), Decimal('22292.62')),
 ('Cruz & Sons Co.', 385, 10108, datetime.date(2003, 3, 3), datetime.date(2003, 3, 8), Decimal('51001.22')),
 ('Motor Mint Distributors Inc.', 486, 10109, datetime.date(2003, 3, 10), datetime.date(2003, 3, 11), Decimal('25833.14')),
 ('AV Stores, Co.', 187, 10110, datetime.date(2003, 3, 18), datetime.date(2003, 3, 20), Decimal('48425.69')),
 ('Mini Wheels Co.', 129, 10111, datetime.date(2003, 3, 25), datetime.date(2003, 3, 30), Decimal('16537.85')),
 ('Volvo Model Replicas, Co', 144, 10112, datetime.date(2003, 3, 24), datetime.date(2003, 3, 29), Decimal('7674.94')),
 ('Mini Gifts Distributors Ltd.', 124, 10113, datetime.date(2003, 3, 26), datetime.date(2003, 3, 27), Decimal('11044.30')),
 ("La Corne D'abondance, Co.", 172, 10114, datetime.date(2003, 4, 1), datetime.date(2003, 4, 2), Decimal('33383.14')),
 ('Classic Legends Inc.', 424, 10115, datetime.date(2003, 4, 4), datetime.date(2003, 4, 7), Decimal('21665.98')),
 ('Royale Belge', 381, 10116, datetime.date(2003, 4, 11), datetime.date(2003, 4, 13), Decimal('1627.56')),
 ('Dragon Souveniers, Ltd.', 148, 10117, datetime.date(2003, 4, 16), datetime.date(2003, 4, 17), Decimal('44380.15')),
 ('Enaco Distributors', 216, 10118, datetime.date(2003, 4, 21), datetime.date(2003, 4, 26), Decimal('3101.40')),
 ('Salzburg Collectables', 382, 10119, datetime.date(2003, 4, 28), datetime.date(2003, 5, 2), Decimal('35826.33'))]

- There is a CSV file in the final exam zipfile that contains the data.


- ```orderTotal``` is the sum of ```quantityOrdered*priceEach``` over all ```orderdetails``` in the order.

### Task 1

- Create a view that produces the information. Put your SQL below.

### Task 2

- Manually logically create a materialized view ```customer_order_copy```by creating a table that is a copy of the data in the view.


- You must add some SQL to your model that automatically updates the materialized view/copy table whenever the ```orderdetails``` table has a new row inserted.


- Enter and test your DDL below.

### Task 3

- Only certain people should be able to see order details.


- Create a new user in your database ```general_user```. Configure security so that ```general_user``` can only query (read) ```customer_order_copy``` and perform no other operations.


- Put your DDL below.

## Identifying Traitors

- You use the Lahman's Baseball Database for this problem.


- You need the ```People``` table and the ```Appearances``` table.


- A perfidious, modern day traitor is:
    - A player who appeared/played for the Red Sox before ever playing for the Yankees.
    - Subsequently (later) appeared/played for the Yankees.
    - Played/appeared in their first game for any team after the year 2000.
    
    
- Write a query that produces the perfidious, modern day traitors. Your table should have the following columns:
    - ```playerID```
    - ```nameFirst```
    - ```nameLast```
    - ```firstRedSoxGameYear``` is the year of the first appearance for the Red Sox.
    - ```firstYankeeGameYear``` is the year of the first appearance for the Yankees.
    
    
- Order the result by ```nameLast, nameFirst```.


- The ```teamID```  for the Yankees is ```NYA``` and the ```teamID``` for the Red Sox is ```BOS```.


- Put your SQL below.

# MongoDB

- Use the ```episodes``` collection you have previously loaded into MongoDB Atlas.


- An episode has an array ```openingSequenceLocations```.


- Write an aggregation that produces a Pandas data frame of the form:
    - ```openingSequenceLocation```
    - ```numberOfEpisodes``` is the number of episodes that have the location in the opening sequence.
    - ```firstAirDate``` is the air date of the first episode in which the location appears in the opening.
    - ```lastAirDate``` is the air date of the last episode in which the location appears.
    
    
- The zipfile for the final exam contains a CSV file with the result of the aggregation. You must sort your result by ```numOfEpisodes.```


- The data is the following. __Do not worry about the leading index column.__

In [35]:
opening_sequences_df = pandas.read_csv("opening_sequence_info.csv")

In [36]:
opening_sequences_df

          location  numOfEpisodes firstAirDate lastAirDate
0       Winterfell             73      4/17/11     5/19/19
1   King's Landing             73      4/17/11     5/19/19
2         The Wall             67      4/17/11     8/27/17
3          Meereen             30       4/6/14     6/26/16
4          Braavos             21      5/11/14     6/19/16
5      Dragonstone             19       4/1/12     8/27/17
6        Harrenhal             15      4/22/12     5/19/13
7             Pyke             15       4/8/12      8/6/17
8     Vaes Dothrak             15      4/24/11     5/29/16
9            Dorne              9       5/3/15     6/26/16
10        Riverrun              9      4/14/13     6/19/16
11       Dreadfort              7       4/6/14     5/18/14
12         Oldtown              7      7/16/17     8/27/17
13       The Eyrie              7      5/15/11     5/15/16
14           Qarth              7      4/22/12      6/3/12
15     Last Hearth              6      4/14/19     5/19/19
16          Yunkai              6      4/28/13      6/9/13
17       The Twins              5      6/12/11     7/16/17
18     Moat Cailin              4       6/1/14     4/26/15
19         Astapor              4      3/31/13     4/21/13
20       Eastwatch              3      8/13/17     8/27/17
21          Pentos              2      4/17/11     3/29/15

- Write an execute your aggregation below.

# Neo4j

- Use the sample movie data for these questions.

- Write a Cyper query that returns a table with the following information:
    - director
    - movie_title
    - actor
    - movie_released_year
    
    
- The zipfile for the final exam contains a CSV file with a sample result. __Do not worry about the leading index column.__

In [41]:
neo4j_result = pandas.read_csv('neo4j_result.csv')
neo4j_result

           director     movie_title            actor  movie_release_year
0    Lana Wachowski     Speed Racer     Emile Hirsch                2008
1    Lana Wachowski     Speed Racer             Rain                2008
2    Lana Wachowski     Speed Racer  Christina Ricci                2008
3    Lana Wachowski     Speed Racer        Ben Miles                2008
4    Lana Wachowski     Speed Racer   Susan Sarandon                2008
5    Lana Wachowski     Speed Racer     John Goodman                2008
6    Lana Wachowski     Speed Racer      Matthew Fox                2008
7   Lilly Wachowski     Speed Racer     Emile Hirsch                2008
8   Lilly Wachowski     Speed Racer             Rain                2008
9   Lilly Wachowski     Speed Racer  Christina Ricci                2008
10  Lilly Wachowski     Speed Racer        Ben Miles                2008
11  Lilly Wachowski     Speed Racer   Susan Sarandon                2008
12  Lilly Wachowski     Speed Racer     John Goodman                2008
13  Lilly Wachowski     Speed Racer      Matthew Fox                2008
14       Ron Howard     Frost/Nixon     Sam Rockwell                2008
15       Ron Howard     Frost/Nixon    Michael Sheen                2008
16       Ron Howard     Frost/Nixon   Frank Langella                2008
17       Ron Howard     Frost/Nixon     Oliver Platt                2008
18       Ron Howard     Frost/Nixon      Kevin Bacon                2008
19   James Marshall  Ninja Assassin             Rain                2009
20   James Marshall  Ninja Assassin        Ben Miles                2009
21   James Marshall  Ninja Assassin        Rick Yune                2009
22   James Marshall  Ninja Assassin    Naomie Harris                2009
23       Tom Tykwer     Cloud Atlas        Tom Hanks                2012
24       Tom Tykwer     Cloud Atlas    Jim Broadbent                2012
25       Tom Tykwer     Cloud Atlas      Halle Berry                2012
26       Tom Tykwer     Cloud Atlas     Hugo Weaving                2012
27   Lana Wachowski     Cloud Atlas        Tom Hanks                2012
28   Lana Wachowski     Cloud Atlas    Jim Broadbent                2012
29   Lana Wachowski     Cloud Atlas      Halle Berry                2012
30   Lana Wachowski     Cloud Atlas     Hugo Weaving                2012
31  Lilly Wachowski     Cloud Atlas        Tom Hanks                2012
32  Lilly Wachowski     Cloud Atlas    Jim Broadbent                2012
33  Lilly Wachowski     Cloud Atlas      Halle Berry                2012
34  Lilly Wachowski     Cloud Atlas     Hugo Weaving                2012

- Execute your Neo4j query below.